import React, { Component } from 'react';
import Modal from 'react-awesome-modal';
import CustomButton from '../../custombutton/custombutton.component';

import '../Modal-a3/Modal-a3.styles.scss';

export default class Modala7 extends Component {
    constructor(props) {
        super(props);
        this.state = {
            visible : false
        }
    }

    openModal() {
        this.setState({
            visible : true
        });
    }

    closeModal() {
        this.setState({
            visible : false
        });
    }

    render() {
        return (
            <div>
                <CustomButton className='buttonmodal' onClick={() => this.openModal()} >توضیحات بیشتر</CustomButton>
                <Modal visible={this.state.visible} width="1500" height="500" effect="fadeInUp" onClickAway={() => this.closeModal()}>
                    <div className='paracontainer'>
                        <p className='paramodal'>
                        به گزارش خبرنگار اجتماعی خبرگزاری تسنیم، آئین بهره‌برداری از باغ‌راه شهدای مدافع سلامت در مجموعه مدیریت پسماند شهر تهران با حضور محمد علیخانی، آرش میلانی، حجت نظری و شهربانو امانی از اعضای شورای شهر تهران و صدرالدین علیپور مدیرعامل سازمان مدیریت پسماند شهر تهران و حمیدرضا چوبینه مدیرعامل شرکت شهر سالم شهرداری تهران برگزار شد.

صدرالدین علیپور مدیریت سازمان پسماند شهر تهران در این مراسم ضمن گرامیداشت شهدای مدافع سلامت اظهار کرد: در ایام کرونا کادر درمان پرستاران، پزشکان و همچنین مجموعه همکاران ما در سازمان پسماند حضور مؤثری را در عرصه خدمت رسانی داشتند. با توجه به اینکه در هفته درختکاری هستیم و موضوع درختکاری در راستای کمک به محیط زیست و افزایش کیفیت زندگی شهروندان است به همین دلیل برنامه‌ریزی صورت گرفت تا نهال‌هایی به یادبود افرادی که در یکسال گذشته در عرصه خدمت رسانی جان خود را از دست داده‌اند انجام شود. بر همین اساس 78 نهال به نیت 78 پزشک، پرستار، کادر درمان و همچنین همکاران ما در سازمان پسماند غرس شد.

وی ادامه داد: شهدای مدافع سلامت که امروز به نام آنها نهال در مجموعه پسماند تحت عنوان باغ‌راه شهدای مدافع سلامت غرس شد از کسانی بودند که در عرصه خدمت‌رسانی تلاش‌های بسیاری را انجام دادند.

مدیرعامل سازمان مدیریت پسماند شهر تهران همچنین ادامه داد: برهمین اساس تدابیری از سوی سازمان پسماند و شرکت شهر سالم انجام شده است تا به خانواده های همکارانی که در این مسیر جان خود را  از دست دادند کمکهایی انجام شود.

علیپور همچنین از پرداخت کمکهای بلاعوض به شهدای مدافع سلامت و کسانی که در شهرداری تهران در سازمان پسماند و شرکت شهر سالم جان خود را از دست دادند اشاره کرد و گفت: تلاش خواهد شد تا کمکها به زودی در اختیار این خانواده‌ها قرار گیرد.

وی همچنین در این مراسم با اشاره به اینکه پیش از کرونا روزانه 60 تا 70 تن پسماند پزشکی در سطح شهر تهران جمع‌آوری می شد گفت: این رقم در زمان شیوع ویروس کرونا و در ماه‌هایی که این ویروس جهش بسیاری را در سطح شهر تهران داشت به بیش از 120 تن افزایش یافت اما در حال حاضر میزان پسماند پزشکی به 90 تا 100 تن در روز رسیده است.

مدیرعامل سازمان مدیریت پسماند شهر تهران با بیان اینکه پسماند پزشکی توسط ناوگان‌های در نظر گرفته شده جمع‌آوری می‌شود گفت: این پسماندها به سایت پسماند پزشکی مستقر در مجموع آرادکوه منتقل می شود.
 </p>
                        <CustomButton className='buttonmodal' onClick={() => this.closeModal()}>بستن</CustomButton>
                    </div>
                </Modal>
            </div>
        );
    }
}
